{
  "home": "Home",
  "trayectoria": "My Journey",
  "proyectos": "Projects",
  "motivacion": "Motivation",
  "contacto": "Contact",
  "slogan": "Frontend Developer — sharp logic, instinctive problem-solver",
  "intro": "I think like a developer, design like a user, and solve like someone who sees beyond the bug.\n\nEvery line of code I write has intention. I learn what the project needs and apply it right when it matters. I don’t collect tools. I transform.\n\nI’m in a polishing phase, yes. But I already bring value, structure, and direction. I’m not a finished product. I’m evolution with character.\n\nAnd what I carry inside... that can’t be taught.",
  "timeline": {
    "2018": {
      "title": "Versatile beginnings",
      "description": "I started my professional journey in administration and customer service roles, developing key skills in organization, communication, and problem-solving."
    },
    "2022": {
      "title": "Turning to tech",
      "description": "I began formal training in software development, combining my background with studies in programming, databases, and user interface design."
    },
    "2023": {
      "title": "Hands-on experience",
      "description": "I joined a real dev team for my internship, contributing to frontend and backend modules, working in Agile sprints and real product delivery cycles."
    },
    "2024": {
      "title": "Web developer role",
      "description": "I joined a corporate web project, working on a custom internal framework, delivering new features, integrating APIs, and improving user experience in Agile teams."
    },
    "2025": {
      "title": "Refinement and growth",
      "description": "I strengthen my technical and creative identity with the launch of this portfolio and deepening specialization in modern frontend. I'm evolution in motion."
    }
  },
  "projects": {
    "animals": {
      "title": "Animal Match Game",
      "date": "Apr. 2025",
      "affiliation": "In collaboration with Lemoncoders",
      "description": "“Animal Match Game” is a visual memory game for children. The goal is to match pairs of animal cards like puppies, chicks, or piglets. 🐶🐣🐷",
      "features": [
        "Cards are initially displayed face down",
        "Matching pairs remain visible",
        "Each pair found brings a sense of achievement",
        "Designed to stimulate children’s memory skills"
      ]
    }
  },
  "verDemo": "View demo",
  "verRepositorio": "View repository",
  "motivacionTitulo": "Motivation",
  "motivacionTexto": "I never imagined I’d end up in the world of web development.\n\nFor years, I moved between patients, paperwork, logistics and people. I did a bit of everything: caring, organizing, solving. I liked making things work for others.\n\nBut something inside me asked for more. More creativity, more challenge, more future.\n\nI started exploring what else was out there—something I didn’t know yet, but that could connect with who I already am and let me be even more of it.\n\nI discovered that programming wasn’t just writing code. It was solving problems, designing experiences, improving systems and understanding needs.\n\nI didn’t leave behind who I was. I transformed it.\n\nToday I don’t care for patients, but I still listen. I don’t manage documents, but I organize logic. I don’t translate languages, but I turn ideas into interfaces.\n\nCode also cares, organizes and solves. But it also builds. And for someone like me, that was a revolution.\n\nThis is not a career change. It’s evolution with purpose.\n\nSince then, I haven’t stopped. Not just learning, but imagining. Because now I finally know I can create what I used to just manage.",
  "contactoTexto": "I didn’t come to please.\nI don’t make noise.\nI’m not for everyone.\nBut if something here resonated with you…\nHere are my coordinates."
}